import streamlit as st


st.set_page_config(page_title="Eco-IT Portal", layout="wide")

st.sidebar.title("🌿 Навігація")
topic = st.sidebar.radio(
    "Оберіть біологічну тему:",
    ("Головна", "Ботаніка та ШІ", "Зоологія та моніторинг", "Екологія та переробка")
)



if topic == "Головна":
    st.title("IT у збереженні природи 🌍")
    st.write("Ласкаво просимо! Оберіть тему в меню зліва, щоб дізнатися, як ШІ допомагає біології.")

elif topic == "Ботаніка та ШІ":
    st.header("Розпізнавання рослин за допомогою ШІ")
    st.write("Тут можна впровадити модель, яка розпізнає види за фото.")
   
    uploaded_file = st.file_uploader("Завантажте фото листка:", type=["jpg", "png"])

elif topic == "Зоологія та моніторинг":
    st.header("Відстеження популяцій тварин")
    st.write("Використання нейромереж для підрахунку тварин на знімках з дронів.")
    st.info("ШІ допомагає виявляти браконьєрів у заповідниках у реальному часі.")

elif topic == "Екологія та переробка":
    st.header("Розумне сортування сміття")
    st.write("ШІ-камери на заводах автоматично сортують пластик, папір та метал.")
    st.success("Це підвищує ефективність переробки на 60%!")